In [15]:
# Dependencies
import numpy as np
import pandas as pd
# Python SQL toolkit and Object Relational Mapper
import sqlalchemy
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
from sqlalchemy import create_engine, func,inspect

In [6]:
engine = create_engine("sqlite:///hawaii.sqlite")

In [9]:
inspector_gadget = inspect(engine)
tables = inspector_gadget.get_table_names()
for table in tables:
    print(table)

    columns = inspector_gadget.get_columns(table)
    for col in columns:
        print(col)

measurement
{'name': 'id', 'type': INTEGER(), 'nullable': False, 'default': None, 'autoincrement': 'auto', 'primary_key': 1}
{'name': 'station', 'type': TEXT(), 'nullable': True, 'default': None, 'autoincrement': 'auto', 'primary_key': 0}
{'name': 'date', 'type': TEXT(), 'nullable': True, 'default': None, 'autoincrement': 'auto', 'primary_key': 0}
{'name': 'prcp', 'type': FLOAT(), 'nullable': True, 'default': None, 'autoincrement': 'auto', 'primary_key': 0}
{'name': 'tobs', 'type': FLOAT(), 'nullable': True, 'default': None, 'autoincrement': 'auto', 'primary_key': 0}
station
{'name': 'id', 'type': INTEGER(), 'nullable': False, 'default': None, 'autoincrement': 'auto', 'primary_key': 1}
{'name': 'station', 'type': TEXT(), 'nullable': True, 'default': None, 'autoincrement': 'auto', 'primary_key': 0}
{'name': 'name', 'type': TEXT(), 'nullable': True, 'default': None, 'autoincrement': 'auto', 'primary_key': 0}
{'name': 'latitude', 'type': FLOAT(), 'nullable': True, 'default': None, 'autoincrement': 'auto', 'primary_key': 0}
{'name': 'longitude', 'type': FLOAT(), 'nullable': True, 'default': None, 'autoincrement': 'auto', 'primary_key': 0}
{'name': 'elevation', 'type': FLOAT(), 'nullable': True, 'default': None, 'autoincrement': 'auto', 'primary_key': 0}

In [11]:
engine.execute('select * from measurement limit 5').fetchall()

[(1, 'USC00519397', '2010-01-01', 0.08, 65.0),
 (2, 'USC00519397', '2010-01-02', 0.0, 63.0),
 (3, 'USC00519397', '2010-01-03', 0.0, 74.0),
 (4, 'USC00519397', '2010-01-04', 0.0, 76.0),
 (5, 'USC00519397', '2010-01-06', None, 73.0)]

In [12]:
engine.execute('select * from station limit 5').fetchall()

[(1, 'USC00519397', 'WAIKIKI 717.2, HI US', 21.2716, -157.8168, 3.0),
 (2, 'USC00513117', 'KANEOHE 838.1, HI US', 21.4234, -157.8015, 14.6),
 (3, 'USC00514830', 'KUALOA RANCH HEADQUARTERS 886.9, HI US', 21.5213, -157.8374, 7.0),
 (4, 'USC00517948', 'PEARL CITY, HI US', 21.3934, -157.9751, 11.9),
 (5, 'USC00518838', 'UPPER WAHIAWA 874.3, HI US', 21.4992, -158.0111, 306.6)]

In [21]:
conn = engine.connect()
query = """
        select 
        * 
        from 
        measurement m 
        join station s on m.station = s.station
        where date like '%-06-%';
"""
df = pd.read_sql(query,conn)
df.head()

,id,station,date,prcp,tobs,id,station,name,latitude,longitude,elevation
0,134,USC00519397,2010-06-01,0.00,78.0,1,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0
1,135,USC00519397,2010-06-02,0.01,76.0,1,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0
2,136,USC00519397,2010-06-03,0.00,78.0,1,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0
3,137,USC00519397,2010-06-04,0.00,76.0,1,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0
4,138,USC00519397,2010-06-05,0.00,77.0,1,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0

In [20]:
df.tobs.describe()

count    1700.000000
mean       74.944118
std         3.257417
min        64.000000
25%        73.000000
50%        75.000000
75%        77.000000
max        85.000000
Name: tobs, dtype: float64

In [32]:
conn = engine.connect()
query = """
        select 
        * 
        from 
        measurement m 
        join station s on m.station = s.station
        where date like '%-12-%';
"""
df1 = pd.read_sql(query,conn)
df1.head()

,id,station,date,prcp,tobs,id,station,name,latitude,longitude,elevation
0,306,USC00519397,2010-12-01,0.04,76.0,1,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0
1,307,USC00519397,2010-12-03,0.00,74.0,1,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0
2,308,USC00519397,2010-12-04,0.00,74.0,1,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0
3,309,USC00519397,2010-12-06,0.00,64.0,1,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0
4,310,USC00519397,2010-12-07,0.00,64.0,1,USC00519397,"WAIKIKI 717.2, HI US",21.2716,-157.8168,3.0

In [33]:
df1.tobs.describe()

count    1517.000000
mean       71.041529
std         3.745920
min        56.000000
25%        69.000000
50%        71.000000
75%        74.000000
max        83.000000
Name: tobs, dtype: float64

In [24]:
engine = create_engine("sqlite:///hawaii.sqlite")

# reflect an existing database into a new model
Base = automap_base()
# reflect the tables
Base.prepare(engine, reflect=True)

# Save references to each table
Measurement = Base.classes.measurement
Station = Base.classes.station

In [25]:
# Create our session (link) from Python to the DB
session = Session(engine)

## D1: Determine the Summary Statistics for June

In [26]:
# 1. Import the sqlalchemy extract function.
from sqlalchemy import extract

# 2. Write a query that filters the Measurement table to retrieve the temperatures for the month of June. 
june_temps = session.query(Measurement).filter(func.strftime("%m",Measurement.date)=='06').all()
june_temps[0:5]

[<sqlalchemy.ext.automap.measurement at 0x7fd2f7ab24d0>,
 <sqlalchemy.ext.automap.measurement at 0x7fd2f7ab2550>,
 <sqlalchemy.ext.automap.measurement at 0x7fd2f7ab25d0>,
 <sqlalchemy.ext.automap.measurement at 0x7fd2f7ab2650>,
 <sqlalchemy.ext.automap.measurement at 0x7fd2f7ab26d0>]

In [28]:
#  3. Convert the June temperatures to a list.
tobs = [x.tobs for x in june_temps]
tobs[0:5]

[78.0, 76.0, 78.0, 76.0, 77.0]

In [29]:
# 4. Create a DataFrame from the list of temperatures for the month of June. 
june_df = pd.DataFrame()
june_df["June Temps"] = tobs
june_df.head()

   June Temps
0        78.0
1        76.0
2        78.0
3        76.0
4        77.0

In [30]:
# 5. Calculate and print out the summary statistics for the June temperature DataFrame.
june_df.describe()

        June Temps
count  1700.000000
mean     74.944118
std       3.257417
min      64.000000
25%      73.000000
50%      75.000000
75%      77.000000
max      85.000000

## D2: Determine the Summary Statistics for December

In [34]:
# 6. Write a query that filters the Measurement table to retrieve the temperatures for the month of December.
dec_temps = session.query(Measurement).filter(func.strftime("%m",Measurement.date)=='12').all()
dec_temps[0:5]

[<sqlalchemy.ext.automap.measurement at 0x7fd2fbc9ea90>,
 <sqlalchemy.ext.automap.measurement at 0x7fd2fb30d510>,
 <sqlalchemy.ext.automap.measurement at 0x7fd2fbc9eb50>,
 <sqlalchemy.ext.automap.measurement at 0x7fd2fbc9ebd0>,
 <sqlalchemy.ext.automap.measurement at 0x7fd2fbc9ec50>]

In [37]:
# 7. Convert the December temperatures to a list.
tobs1 = [x.tobs for x in dec_temps]
tobs1[0:5]

[76.0, 74.0, 74.0, 64.0, 64.0]

In [38]:
# 8. Create a DataFrame from the list of temperatures for the month of December. 
dec_df = pd.DataFrame()
dec_df['Dec Temps'] = tobs1
dec_df.head()

   Dec Temps
0       76.0
1       74.0
2       74.0
3       64.0
4       64.0

In [39]:
# 9. Calculate and print out the summary statistics for the Decemeber temperature DataFrame.
dec_df.describe()

         Dec Temps
count  1517.000000
mean     71.041529
std       3.745920
min      56.000000
25%      69.000000
50%      71.000000
75%      74.000000
max      83.000000